## Assignment(23/FEB/2023) PANDAS BASICS

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [8]:
## answer 1

import pandas as pd

data = pd.Series([4,8,15,16,23,42])
print(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it

In [11]:
## Answer 2

variable = ['Neel','Het','Dev','Ravi','Jay','Zeel','Ved','Siya','Mahi','Raj']

pd.Series(variable)

0    Neel
1     Het
2     Dev
3    Ravi
4     Jay
5    Zeel
6     Ved
7    Siya
8    Mahi
9     Raj
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [14]:
import pandas as pd

data = pd.DataFrame({'Name':['Alice','Bob','Claire'],
                     'Age' :[25,30,27],
                     'Gender':['Female','Male','Female']})

print(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
## answer 4

=> Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes.
=> Pandas DataFrame consists of three principal components, the data, rows, and columns.
=> pandas.Series Is a one dimensional array while data frame is two dimensional.

In [16]:
## Example:

import pandas as pd
 
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
 
df = pd.DataFrame(data)
 
print(df)

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can 
you give an example of when you might use one of these functions?

In [ ]:
## Answer 5:

Some functions used to manipulate data in pandas data frame are as follow:
    
1. Head : USD to display records from above side default value is 5.
2. Tail : used to display records from the bottom and can mention the size by writing number in bracket.
3. Columns : used to write all column names.

In [ ]:
##example:

In [17]:
import pandas as pd

data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
 
df = pd.DataFrame(data)

df.head(2)

   Name  Age
0   Tom   20
1  nick   21

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
## Answer 6:

=> data frame and panel is mutable in nature.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [ ]:
## Answer 7:

By using concat() method you can merge multiple series together into DataFrame. This takes several params, for our scenario we use list that takes series to combine and axis=1 to specify merge series as columns instead of rows. Note that using axis=0 appends series to rows instead of columns.

In [18]:
##example:

import pandas as pd

courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

df=pd.concat([courses,fees],axis=1)

df=pd.concat([courses,fees,discount],axis=1)

print(df)

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000